{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": true, "activation": "relu", "name": "conv2d_1", "padding": "valid", "batch_input_shape": [null, 120, 160, 3], "dtype": "float32", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "activation": "relu", "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "activation": "sigmoid", "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 1}}], "keras_version": "2.1.6", "class_name": "Sequential"}